In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/uuboy.scy/PycharmProjects/pyetl-course/venv/lib/python3.7/site-packages (0.25.1)
Requirement already satisfied: pytz>=2017.2 in /Users/uuboy.scy/PycharmProjects/pyetl-course/venv/lib/python3.7/site-packages (from pandas) (2019.2)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/uuboy.scy/PycharmProjects/pyetl-course/venv/lib/python3.7/site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in /Users/uuboy.scy/PycharmProjects/pyetl-course/venv/lib/python3.7/site-packages (from pandas) (1.17.2)
Requirement already satisfied: six>=1.5 in /Users/uuboy.scy/PycharmProjects/pyetl-course/venv/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)

In [2]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age', 'Height'])

df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Allen', '22', '175']

In [4]:
df

    Name Age Height
0  Allen  22    175

In [5]:
df.loc[1] = ['Ted', '25', '180']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [6]:
df['Weight'] = ['75', '80']

In [7]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [8]:
df.drop(['Weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [9]:
df

    Name Age Height Weight
0  Allen  22    175     75
1    Ted  25    180     80

In [10]:
df = df.drop(['Weight'], axis=1)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [11]:
df.drop(0)

  Name Age Height
1  Ted  25    180

In [12]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [13]:
df = df.drop(0)
df

  Name Age Height
1  Ted  25    180

In [14]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df.loc[0] = ['Allen', '22', '175']
df.loc[1] = ['Ted', '25', '180']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [16]:
df['Name'][1] = 'Jack'

In [17]:
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180

In [18]:
df['Age'] = 200

In [19]:
df

    Name  Age Height
0  Allen  200    175
1   Jack  200    180

In [21]:
df.loc[1] = 'Ted'

In [22]:
df

    Name  Age Height
0  Allen  200    175
1    Ted  Ted    Ted

In [23]:
columns = ['Name', 'Age', 'Height']
d1 = ['Allen', '22', '175']
d2 = ['Ted', '25', '180']
data = [d1, d2]

df = pd.DataFrame(data=data, columns=columns)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [25]:
df.to_csv('./test.csv', index=0)

In [26]:
df = pd.read_csv('./test.csv')
df

    Name  Age  Height
0  Allen   22     175
1    Ted   25     180